src/staticresources/TestMockResponsVAP.resource

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns1:ItemLocation xmlns:ns1="http://new.webservice.namespace"><ns1:Note>Note</ns1:Note><ns1:UserArea><ns2:VapDistributionDetailsResponse xmlns:ns2="urn:Namespaces.PostNord.Com:Private:Customer:VapDistributionDetailsResponse:v0001"><ns2:Letter_1478><callResponse xmlns="http://www.postdanmark.dk/WSTuxWrapper/WSTuxWrapper/"><parameters><callResponse xmlns="http://www.postdanmark.dk/WSTuxWrapper/WSTuxWrapper/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><ns1:tuxresults xmlns:ns1="java:dk.post.tuxwswrapper.model"><ns1:TuxResult><ns1:recordcount>1</ns1:recordcount><ns1:servicename>vapFruteOpl</ns1:servicename><ns1:fields><ns1:ResultField><ns1:name>VAP_interessent_nr</ns1:name><ns1:occ>0</ns1:occ><ns1:value>624842017</ns1:value></ns1:ResultField><ns1:ResultField><ns1:name>VAP_team_intr_nr</ns1:name><ns1:occ>0</ns1:occ><ns1:value>612062752</ns1:value></ns1:ResultField><ns1:ResultField><ns1:name>VAP_rutenavn</ns1:name><ns1:occ>0</ns1:occ><ns1:value>Rute 8</ns1:value></ns1:ResultField><ns1:ResultField><ns1:name>VAP_rutekode</ns1:name><ns1:occ>0</ns1:occ><ns1:value>008</ns1:value></ns1:ResultField><ns1:ResultField><ns1:name>VAP_anmeld_intr_nr</ns1:name><ns1:occ>0</ns1:occ><ns1:value>741576406</ns1:value></ns1:ResultField></ns1:fields><ns1:resultincomplete>false</ns1:resultincomplete><ns1:error xsi:nil="true"/><ns1:recordcontext>0</ns1:recordcontext></ns1:TuxResult></ns1:tuxresults></callResponse></parameters></callResponse></ns2:Letter_1478><ns2:Parcel_25><callResponse xmlns="http://www.postdanmark.dk/WSTuxWrapper/WSTuxWrapper/"><parameters><callResponse xmlns="http://www.postdanmark.dk/WSTuxWrapper/WSTuxWrapper/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><ns1:tuxresults xmlns:ns1="java:dk.post.tuxwswrapper.model"><ns1:TuxResult><ns1:recordcount>1</ns1:recordcount><ns1:servicename>vapFruteOpl</ns1:servicename><ns1:fields><ns1:ResultField><ns1:name>VAP_interessent_nr</ns1:name><ns1:occ>0</ns1:occ><ns1:value>624842017</ns1:value></ns1:ResultField><ns1:ResultField><ns1:name>VAP_team_intr_nr</ns1:name><ns1:occ>0</ns1:occ><ns1:value>612062752</ns1:value></ns1:ResultField><ns1:ResultField><ns1:name>VAP_rutenavn</ns1:name><ns1:occ>0</ns1:occ><ns1:value>Pakker LANDPAKKER</ns1:value></ns1:ResultField><ns1:ResultField><ns1:name>VAP_rutekode</ns1:name><ns1:occ>0</ns1:occ><ns1:value>521</ns1:value></ns1:ResultField><ns1:ResultField><ns1:name>VAP_anmeld_intr_nr</ns1:name><ns1:occ>0</ns1:occ><ns1:value>741576406</ns1:value></ns1:ResultField></ns1:fields><ns1:resultincomplete>false</ns1:resultincomplete><ns1:error xsi:nil="true"/><ns1:recordcontext>0</ns1:recordcontext></ns1:TuxResult></ns1:tuxresults></callResponse></parameters></callResponse></ns2:Parcel_25></ns2:VapDistributionDetailsResponse></ns1:UserArea></ns1:ItemLocation></SOAP-ENV:Body></SOAP-ENV:Envelope>